# Intro to Relational Database

In [ ]:
# Query the right table in information_schema
SELECT table_name 
FROM information_schema.tables
#Specify the correct table_schema value
WHERE table_schema = 'public';

# Query the right table in information_schema to get columns
SELECT column_name, data_type 
FROM information_schema.columns 
WHERE table_name = 'university_professors' AND table_schema = 'public';

# Query the first five rows of our table
SELECT * 
FROM university_professors 
LIMIT 5;

# Tables: At the core of every database

In [ ]:
# create two tables to split the table

CREATE TABLE professors(
    firstname text,
    lastname text);
SELECT * 
FROM professors

# Create a table for the universities entity type
CREATE TABLE universities (
    university_shortname text,
    university text,
    university_city text
);
# Print the contents of this table
SELECT * 
FROM universities

In [ ]:
# adding column to table
ALTER TABLE table_name
ADD COLUMN column_name data_type;

#Add the university_shortname column
ALTER TABLE professors
ADD COLUMN university_shortname text;

#Print the contents of this table
SELECT * 
FROM professors

# Update your database as the structure changes

In [ ]:
# insert data to columns
INSERT INTO tablename(col1, col2, col3)
VALUES('a1', 'a2', 'a3')

#rename column
ALTER TABLE tablename
RENAME COLUMN old_col_name to new_col_name

#drop column
ALTER TABLE tablename
DROP COLUMN col_name

In [ ]:
# Rename the organisation column
ALTER TABLE affiliations
RENAME COLUMN organisation TO organization;

# Delete the university_shortname column
ALTER TABLE affiliations
DROP COLUMN university_shortname;

In [ ]:
#Migrate data with INSERT INTO SELECT DISTINCT
SELECT DISTINCT column_name1, column_name2, ... 
FROM table_a;

INSERT INTO table_b ...;

In [ ]:
# Insert unique professors into the new table
INSERT INTO professors 
SELECT DISTINCT firstname, lastname, university_shortname 
FROM university_professors;

# Doublecheck the contents of professors
SELECT * 
FROM professors;

# Insert unique affiliations into the new table
INSERT INTO affiliations
SELECT DISTINCT firstname, lastname, function, organization
FROM university_professors;

# Doublecheck the contents of affiliations
SELECT * 
FROM affiliations;

In [ ]:
# Delete the university_professors table
DROP TABLE university_professors;

# Better data quality with constraints

In [ ]:
CREATE TABLE transactions (
 transaction_date date, 
 amount integer,
 fee text
);

# Let's add a record to the table
INSERT INTO transactions (transaction_date, amount, fee) 
VALUES ('2018-09-24', 5454, '30');

# Doublecheck the contents
SELECT *
FROM transactions;

In [ ]:
# for data type issues use cast
SELECT CAST(some_column AS integer)
FROM table;

# Calculate the net amount as amount + fee
SELECT transaction_date, amount + CAST(fee AS integer) AS net_amount 
FROM transactions;

# Working with data types

In [ ]:
# changing data type
ALTER TABLE tablename
ALTER COLUMN colname
TYPE integer
USING round(colname);

In [ ]:
# Specify the correct fixed-length character type
ALTER TABLE professors
ALTER COLUMN university_shortname
TYPE char(3);

# Change the type of firstname
ALTER TABLE professors
ALTER COLUMN firstname
TYPE varchar(64);

In [ ]:
# how to change it to a lower varchar
ALTER TABLE table_name
ALTER COLUMN column_name
TYPE varchar(x)
USING SUBSTRING(column_name FROM 1 FOR x)

# Convert the values in firstname to a max. of 16 characters
ALTER TABLE professors 
ALTER COLUMN firstname 
TYPE varchar(16)
USING SUBSTRING(firstname FROM 1 FOR 16)

# The not-null and unique constraints

In [ ]:
# Disallow NULL values in lastname
ALTER TABLE professors
ALTER COLUMN lastname SET NOT NULL;

# Disallow NULL values in firstname
ALTER TABLE professors
ALTER COLUMN firstname SET NOT NULL;

In [ ]:
# make a column name unique
CREATE TABLE table_name (
 column_name UNIQUE
);

# add unique constraint
ALTER TABLE table_name
ADD CONSTRAINT some_name UNIQUE(column_name);

In [ ]:
# Make universities.university_shortname unique
ALTER TABLE universities
ADD CONSTRAINT university_shortname_unq UNIQUE(university_shortname);

#Make organizations.organization unique
ALTER TABLE organizations
ADD CONSTRAINT organization_unq UNIQUE(organization)

# Keys and superkeys

In [ ]:
# Get to know SELECT COUNT DISTINCT
# Count the number of rows in universities
SELECT COUNT(DISTINCT(university_shortname, university, university_city)) 
FROM universities;

# Count the number of distinct values in the university_city column
SELECT COUNT(distinct(university_city)) 
FROM universities;

HOW TO FIND SUPER KEYS

1) Count the distinct records for all possible combinations of columns. If the resulting number x equals the number of all rows in the table for a combination, you have discovered a superkey.

2) Then remove one column after another until you can no longer remove columns without seeing the number x decrease. If that is the case, you have discovered a (candidate) key.

In [ ]:
# Try out different combinations
SELECT COUNT(DISTINCT(lastname, firstname)) 
FROM professors;
#only combination that uniquely identifies professors is {firstname, lastname}. 
#{firstname, lastname, university_shortname} is a superkey, 
# and all other combinations give duplicate values.

# Primary keys

In [ ]:
# primary key for car database is license plate

#adding a primary key to your table
ALTER TABLE table_name
ADD CONSTRAINT some_name PRIMARY KEY (column_name)

In [ ]:
# Rename the university_shortname column to id
ALTER TABLE universities
RENAME COLUMN university_shortname TO id;

# Make id a primary key
ALTER TABLE universities
ADD CONSTRAINT university_pk PRIMARY KEY (id);

ALTER TABLE professors
RENAME COLUMN lastname to id;

ALTER TABLE professors
ADD CONSTRAINT lastname_pk PRIMARY KEY(id)

# Surrogate keys

In [ ]:
# since we dont have a primary key for professors table columns (firstname, lastname, university_shortname)
# we make new column firstname+lastname as the primary key

# Add the new column to the table
ALTER TABLE professors 
ADD COLUMN id serial;

# Make id a primary key
ALTER TABLE professors 
ADD CONSTRAINT professors_pkey PRIMARY KEY (id);

# Have a look at the first 10 rows of professors
SELECT *
FROM professors
LIMIT(10);

In [ ]:
# adding a surrogate key to an existing table
CREATE TABLE cars (
 make varchar(64) NOT NULL,
 model varchar(64) NOT NULL,
 mpg integer NOT NULL
)

# Count the number of distinct rows with columns make, model
SELECT COUNT(DISTINCT(make, model)) 
FROM cars;

# Add the id column. Add column
ALTER TABLE cars
ADD COLUMN id varchar(128);

# Update id with make + model. Make the column make +modle
UPDATE cars
SET id = CONCAT(make, model);

# Make id a primary key. Make the column a primary key
ALTER TABLE cars
ADD CONSTRAINT id_pk primary key(id);

# Have a look at the table
SELECT * FROM cars;

In [ ]:
#  Create the table
CREATE TABLE students (
  last_name varchar(128) NOT NULL,
  ssn integer PRIMARY KEY,
  phone_no char(12)
);

# Model 1:N relationships with foreign keys

In [ ]:
# reference a table with foreign key
ALTER TABLE a 
ADD CONSTRAINT a_fkey FOREIGN KEY (b_id) REFERENCES b (id);

# Rename the university_shortname column
ALTER TABLE professors
RENAME COLUMN university_shortname TO university_id;

# Add a foreign key on professors referencing universities
ALTER TABLE professors 
ADD CONSTRAINT professors_fkey FOREIGN KEY (university_id) REFERENCES universities (id);

In [ ]:
# Try to insert a new professor
INSERT INTO professors (firstname, lastname, university_id)
VALUES ('Albert', 'Einstein', 'UZH');

In [ ]:
# joining tables
SELECT ...
FROM table_a
JOIN table_b
ON ...
WHERE ...

In [ ]:
# Select all professors working for universities in the city of Zurich
SELECT professors.lastname, universities.id, universities.university_city
FROM professors 
JOIN universities
ON professors.university_id = universities.id
WHERE universities.university_city = 'Zurich';

# Model more complex relationships

In [ ]:
# Add a professor_id column
ALTER TABLE affiliations
ADD COLUMN professor_id integer REFERENCES professors (id);

# Rename the organization column to organization_id
ALTER TABLE affiliations
RENAME organization TO organization_id;

# Add a foreign key on organization_id
ALTER TABLE affiliations
ADD CONSTRAINT affiliations_organization_fkey foreign KEY (organization_id) REFERENCES organizations (id);

In [ ]:
# how to update columns in table
UPDATE table_a
SET column_to_update = table_b.column_to_update_from
FROM table_b
WHERE condition1 AND condition2 AND ...;

In [ ]:
# Update professor_id to professors.id where firstname, lastname correspond to rows in professors
UPDATE affiliations
SET professor_id = professors.id
FROM professors
WHERE affiliations.firstname = professors.firstname AND affiliations.lastname = professors.lastname;

# Have a look at the 10 first rows of affiliations again
SELECT * 
FROM affiliations
LIMIT(10);

In [ ]:
# Drop the firstname column
ALTER TABLE affiliations
DROP COLUMN firstname;

# Drop the lastname column
ALTER TABLE affiliations
DROP COLUMN lastname;

# Referential integrity

In [ ]:
# keys
professors.university_id to universities.id
affiliations.organization_id to organizations.id
affiliations.professor_id to professors.id

In [ ]:
# Identify the correct constraint name
SELECT constraint_name, table_name, constraint_type
FROM information_schema.table_constraints
WHERE constraint_type = 'FOREIGN KEY';

# Drop the right foreign key constraint
ALTER TABLE affiliations
DROP CONSTRAINT affiliations_organization_id_fkey;

# Add a new foreign key constraint from affiliations to organizations which cascades deletion
ALTER TABLE affiliations
ADD CONSTRAINT affiliations_organization_id_fkey FOREIGN KEY (organization_id) REFERENCES organizations (id) ON DELETE CASCADE;

# Delete an organization 
DELETE FROM organizations 
WHERE id = 'CUREM';

# Check that no more affiliations with this organization exist
SELECT * FROM affiliations
WHERE organization_id = 'CUREM';

# Roundup

In [ ]:
SELECT table_a.column1, table_a.column2, table_b.column1, ... 
FROM table_a
JOIN table_b 
ON table_a.column = table_b.column

In [ ]:
#  Count the total number of affiliations per university
SELECT COUNT(*), professors.university_id 
FROM affiliations
JOIN professors
ON affiliations.professor_id = professors.id
# Group by the university ids of professors
GROUP BY professors.university_id 
ORDER By count DESC;

In [ ]:
# Join all tables
SELECT *
FROM affiliations
JOIN professors
ON affiliations.professor_id = professors.id
JOIN organizations
ON affiliations.organization_id = organizations.id
JOIN universities
ON professors.university_id = universities.id;

In [ ]:
# Filter the table and sort it
SELECT COUNT(*), organizations.organization_sector, 
professors.id, universities.university_city
FROM affiliations
JOIN professors
ON affiliations.professor_id = professors.id
JOIN organizations
ON affiliations.organization_id = organizations.id
JOIN universities
ON professors.university_id = universities.id
WHERE organizations.organization_sector = 'Media & communication'
GROUP BY organizations.organization_sector, 
professors.id, universities.university_city
ORDER BY count DESC;